views/user/index.php

			'template' => '{leadStatus} {leadUpdate} {leadDelete}',
			'buttons'  => [
				'leadStatus' => function ($url, $model) {
					$user = User::find()
						->where(['id' => $model->id])
						->one();
---
SELECT * FROM `user` WHERE `id`=1