controllers/SiteController.php

    public function actionLogin()
    {
		$this->layout = 'm_login';
        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post())) {
			$user = User::find()
				->where([
					'username' => Yii::$app->request->post('LoginForm')['username'],
					'password' => User::hide('en',Yii::$app->request->post('LoginForm')['password']),
					'status' => 1
				])
				->one();
---
SELECT * FROM `user` WHERE (`username`='petugas') AND (`password`='cFhtWURTcFB6OURpazNrMEFSTmNUQT09') AND (`status`=1)

    public function actionKode()
    {
		$ctrl1=ucwords(Yii::$app->request->queryParams['r'] );
		$ctrl=explode("/", $ctrl1);
		if($ctrl[0]=='Gejala' || $ctrl[0]=='Diagnosa'){
			if($ctrl[0]=='Gejala')
				$cari=Gejala::find()->orderBy("kode DESC")->one()->kode;
---
SELECT * FROM `gejala` ORDER BY `kode` DESC